app/Controllers/siswa.php

SELECT *
FROM `kelas`
---
    public function index()
    {
        $data = ['kelas' => $this->Kelas_Model->findall()];

SELECT *
FROM `kelas`
SELECT *
FROM `bebas`
---
    public function input_siswa()
    {
        $data = [
            'validation' => \Config\Services::validation(),
            'kelas' => $this->Kelas_Model->findall(),
            'spp' => $this->Spp_Model->findall(),
            'bebas' => $this->Bebas_Model->findall()