app/Models/BebasBayar_Model.php

    function cetak_siswa($nis)
    {
        $builder = $this->db->table('bayar_bebas');
        $builder->join('bebas', 'bebas.id_bebas=bayar_bebas.id_bebas')->join('kelas', 'kelas.id_kelas=bayar_bebas.id_kelas')
            ->where('nis', $nis);
        $query = $builder->get();
---
SELECT *
FROM `bayar_bebas`
JOIN `bebas` ON `bebas`.`id_bebas`=`bayar_bebas`.`id_bebas`
JOIN `kelas` ON `kelas`.`id_kelas`=`bayar_bebas`.`id_kelas`
WHERE `nis` = '2222'