app/Models/Home_Model.php

    public function tot_siswa()
    {
        return $this->db('sispp')->table('siswa')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `siswa`

    public function tot_kelas()
    {
        return $this->db('sispp')->table('kelas')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `kelas`

    public function tot_pendapatan()
    {
        $builder = $this->db->table('bayar_bebas');
        $builder->selectSum('jumlah_bayar');
        $query = $builder->get();
---
SELECT SUM(`jumlah_bayar`) AS `jumlah_bayar`
FROM `bayar_bebas`

    public function tot_tunggakan()
    {
        $builder = $this->db->table('tunggakan');
        $builder->selectSum('jumlah');
        $query = $builder->get();
---
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tunggakan`

    public function gettransaksi($tahun)
    {
        return $this->db->table('bayar_bebas as b')->select("MONTH(tgl_bayar) bulan,(jumlah_bayar) total")
            ->where('YEAR(tgl_bayar)', $tahun)->orderBy('jumlah_bayar')
            ->get()->getResultArray();
---
SELECT MONTH(tgl_bayar) bulan, (jumlah_bayar) total
FROM `bayar_bebas` as `b`
WHERE YEAR(tgl_bayar) = '2023'
ORDER BY `jumlah_bayar`

    public function get_jumlah_transaksi($tahun)
    {
        return $this->db->table('bayar_bebas')->select("MONTH(tgl_bayar) bulan, count(tgl_bayar) total")
            ->where('YEAR(tgl_bayar)', $tahun)->orderBy('MONTH(tgl_bayar)')
            ->get()->getResultArray();
---
SELECT MONTH(tgl_bayar) bulan, count(tgl_bayar) total
FROM `bayar_bebas`
WHERE YEAR(tgl_bayar) = '2023'
ORDER BY MONTH(tgl_bayar)