app/Models/Siswa_Model.php

SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`id_kelas`=`siswa`.`id_kelas`
---
    public function getsiswa()
    {
        $builder = $this->db->table('siswa');
        $builder->join('kelas', 'kelas.id_kelas=siswa.id_kelas');
        $query = $builder->get();

SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`id_kelas`=`siswa`.`id_kelas`
WHERE `kelas` = 'X AKL 3'
---
    public function detail_kelas($kelas)
    {
        $builder = $this->db->table('siswa');
        $builder->join('kelas', 'kelas.id_kelas=siswa.id_kelas')->where('kelas', $kelas);
        $query = $builder->get();

SELECT *
FROM `tunggakan`
JOIN `spp` ON `spp`.`id_spp`=`tunggakan`.`id_spp`
JOIN `kelas` ON `kelas`.`id_kelas`=`tunggakan`.`id_kelas`
WHERE `nm_siswa` = 'super admin 2'
---
    public function histori()
    {
        $builder = $this->db->table('tunggakan');
        $builder->join('spp', 'spp.id_spp=tunggakan.id_spp')
            ->join('kelas', 'kelas.id_kelas=tunggakan.id_kelas')->where('nm_siswa', user()->username);
        $query = $builder->get();

SELECT *
FROM `bayar_bebas`
JOIN `kelas` ON `kelas`.`id_kelas`=`bayar_bebas`.`id_kelas`
JOIN `bebas` ON `bebas`.`id_bebas`=`bayar_bebas`.`id_bebas`
WHERE `nama_siswa` = 'super admin 2'
---
    public function histori_bayar()
    {
        $builder = $this->db->table('bayar_bebas');
        $builder->join('kelas', 'kelas.id_kelas=bayar_bebas.id_kelas')->join('bebas', 'bebas.id_bebas=bayar_bebas.id_bebas')
            ->where('nama_siswa', user()->username);
        $query = $builder->get();