app/Models/Tunggakan_Model.php

    public function getsiswa($keyword)
    {
        $builder = $this->db->table('tunggakan');
        $builder->join('spp', 'spp.id_spp=tunggakan.id_spp')
            ->join('kelas', 'kelas.id_kelas=tunggakan.id_kelas')->where('nis', $keyword);
        $query = $builder->get();
---
SELECT *
FROM `tunggakan`
JOIN `spp` ON `spp`.`id_spp`=`tunggakan`.`id_spp`
JOIN `kelas` ON `kelas`.`id_kelas`=`tunggakan`.`id_kelas`
WHERE `nis` = '1'