app/Models/User_Model.php

SELECT *
FROM `users`
JOIN `auth_groups_users` `gs` ON `users`.`id`=`gs`.`user_id`
JOIN `auth_groups` `g` ON `g`.`id`=`gs`.`group_id`
---
    public function get_users()
    {
        $builder = $this->db->table('users');
        $builder->join('auth_groups_users gs', 'users.id=gs.user_id')->join('auth_groups g', 'g.id=gs.group_id');
        $query = $builder->get();